[{"url": "http%3A%2F%2Fwww.usatoday.com%2Fstory%2Fsports%2Fncaab%2F2015%2F11%2F24%2Fcreighton-pulls-away-in-2nd-half-to-beat-rutgers-85-75%2F76298842%2F", "content": "LAS VEGAS (AP) — Cole Huff scored 26 points, and Creighton broke open a close game with 13 consecutive points in the second half to beat <b>Rutgers</b> 85-75 Monday night in the Main Event tournament at the MGM Grand. Huff, who sat out last season after&nbsp;...", "title": "Creighton pulls away in 2nd half to beat <b>Rutgers</b> 85-75"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_star_darius_hamilton_no_matter_happens_ill.html", "content": "PISCATAWAY — When it was announced on Sept. 27 that Darius Hamilton would miss the rest of the season with a knee injury, the defensive tackle said that he planned to return to <b>Rutgers</b> for his final season of eligibility. But Hamilton also emphasized <b>...</b>", "title": "<b>Rutgers</b> star Darius Hamilton: &#39;No matter what happens, I&#39;ll be here&#39;"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_releases_lengthy_injury_report_for_season.html", "content": "PISCATAWAY — <b>Rutgers</b> is limping to the finish line, as the injury report for Saturday&#39;s season finale against Maryland features 25 names. Most notably, weak side linebacker Steve Longa is listed as questionable. The redshirt junior missed the first <b>...</b>", "title": "<b>Rutgers</b> releases lengthy injury report for season finale"}, {"url": "http%3A%2F%2Fwww.nj.com%2Fopinion%2Findex.ssf%2F2015%2F11%2Fschiano_not_the_answer_for_rutgers_football_christ.html", "content": "Here we go again with columnist Steve Politi suggesting that Greg Schiano would be the best fit to coach the <b>Rutgers</b> football team again. It reminds me of the man who leaves his wife and children for a new love. Upon finding that the grass is not <b>...</b>", "title": "Schiano not the answer for <b>Rutgers</b> football, Christie hasn&#39;t always advocated <b>...</b>"}, {"url": "http%3A%2F%2Fwww.app.com%2Fstory%2Fsports%2Fcollege%2Frutgers%2F2015%2F11%2F24%2Frutgers-football-star-darius-hamilton-there-where-want%2F76294664%2F", "content": "PISCATAWAY – The Darius Hamilton conspiracy theories began spreading as soon as it was announced that the <b>Rutgers</b> star would miss his true senior season due to injury. Was he still going to enter the NFL Draft rather than return to school as a redshirt&nbsp;...", "title": "<b>Rutgers</b> star Darius Hamilton: There is where I want to be"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_receiver_leonte_carroo_im_definitely_playi.html", "content": "PISCATAWAY — <b>Rutgers</b> wide receiver Leonte Carroo is listed as probable for Saturday&#39;s home game against Maryland (12 p.m., BTN). As much as coach Kyle Flood prefers to guard injury information, Carroo spoiled any suspense about his status for his&nbsp;...", "title": "<b>Rutgers</b> receiver Leonte Carroo: &#39;I&#39;m definitely playing Saturday&#39;"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Ftimber_creek_junior_cornerback_naijee_jones_commit.html", "content": "Jones, who is being recruited primarily by defensive backs coach Darrell Wilson and <b>Rutgers</b> director of recruiting E.J. Barthel, has had a strong year in 2015. Although his sole offer is from <b>Rutgers</b>, he is being recruited by multiple teams throughout <b>...</b>", "title": "Timber Creek junior cornerback Naijee Jones commits to <b>Rutgers</b> football"}, {"url": "http%3A%2F%2Fwww.app.com%2Fstory%2Fsports%2Fcollege%2F2015%2F11%2F23%2Fcan-rutgers-basketball-go-2-0-las-vegas-week%2F76252012%2F", "content": "The season is still a blank slate for the <b>Rutgers</b> men&#39;s basketball team. That will change this week. After beating three cupcakes and losing a heartbreaker at St. John&#39;s, the 3-1 Scarlet Knights are in Las Vegas for the Men Who Speak Up Main Event,&nbsp;...", "title": "Can <b>Rutgers</b> basketball go 2-0 in Las Vegas this week?"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_home_underdogs_to_2-9_maryland.html", "content": "With a win on Saturday, <b>Rutgers</b> (1-6 Big Ten) will finish fifth in the seven-team Big Ten East Division. If the Scarlet Knights lose, they could fall to last place. Indiana is also 1-6 in Big Ten play and is favored over Purdue on Saturday. Maryland is <b>...</b>", "title": "<b>Rutgers</b> home underdogs to 2-9 Maryland"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2F10_takeaways_from_rutgers_31-21_win_over_army.html", "content": "WEST POINT, N.Y. — <b>Rutgers</b> snapped a four-game losing streak with a 31-21 win over Army on Saturday at Michie Stadium. It wasn&#39;t the prettiest game, but that&#39;s partly due to the way Army plays. The 2-9 Black Knights have been competitive in nearly <b>...</b>", "title": "10 takeaways from <b>Rutgers</b>&#39; 31-21 win over Army"}, {"url": "http%3A%2F%2Fwww.nj.com%2Feducation%2F2015%2F11%2Fhow_rutgers_turned_a_forgotten_skyscraper_into_a_l.html", "content": "NEWARK —For decades, the cavernous building on Washington Street was one of <b>Rutgers</b> University&#39;s biggest embarrassments. The 1920s skyscraper, built as the grand headquarters for a Newark insurance company, served as the home of&nbsp;...", "title": "How <b>Rutgers</b> turned an abandoned skyscraper into a luxury dorm"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_nose_tackle_kevin_wilkins_drawing_uncharac.html", "content": "WEST POINT, N.Y. — Kevin Wilkins very well could have done his job to perfection in <b>Rutgers</b>&#39; first nine games and few would have noticed. That&#39;s the way it goes for nose tackles, whose primary duty is to occupy blockers so their teammates can enjoy <b>...</b>", "title": "<b>Rutgers</b> nose tackle Kevin Wilkins drawing uncharacteristic attention with big <b>...</b>"}, {"url": "https%3A%2F%2Fswimswam.com%2Falexis-brewer-commits-in-state-to-rutgers%2F", "content": "Both of Brewer&#39;s backstroke times are faster than the slowest swimmer <b>Rutgers</b> had at the conference level last year, so she should help them upgrade their backstroke group upon her arrival in New Brunswick. She also has a similar backstroke profile to&nbsp;...", "title": "Alexis Brewer Commits In-State to <b>Rutgers</b>"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Frutgers-faces-tall-task-on-road-trip-at-no-10-wisconsin-ohio-state", "content": "With the weight of the season weighing down on the team, <b>Rutgers</b> moves on to what measures up to be a brutal battle with then-No. 10 Wisconsin (22-6, 14-4). The Knights take on the Badgers on the road for the first time this season. In their first <b>...</b>", "title": "<b>Rutgers</b> faces tall task on road trip at No. 10 Wisconsin, Ohio State"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Fwatch_rutgers_wide_receiver_commit_mohamed_jabbie_1.html", "content": "South Brunswick (Monmouth Junction, N.J.) senior wide receiver and <b>Rutgers</b> commit Mohamed Jabbie caught a game-winning touchdown for his Vikings Friday night when they defeated Manalapan, 27-21, in the semifinal round of the Central Group 5&nbsp;...", "title": "WATCH: <b>Rutgers</b> commit Mo Jabbie makes game-winning TD grab to get Vikings to <b>...</b>"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Fwomens-league-of-rutgers-university-brings-new-layer-of-sisterhood-to-campus", "content": "Unknown to many members of the <b>Rutgers</b> community, there is an age-old organization that gives back to the school and local community in Middlesex County. The various techniques used to help range from funding scholarships for outstanding third-year&nbsp;...", "title": "Women&#39;s League of <b>Rutgers</b> University brings new layer of sisterhood to campus"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Frutgers-senior-former-doo-wop-singer-marilyn-ali-set-to-graduate-college-at-age-65", "content": "After living a life of fame and adventure reminiscent of the fictional characters Forrest Gump and Odysseus, Marilyn Ali is about to make her encore performance as a <b>Rutgers</b> student next semester before the curtain falls on her undergraduate career&#39;s <b>...</b>", "title": "<b>Rutgers</b> senior, former doo-wop singer Marilyn Ali set to graduate college at <b>...</b>"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Fstats_werent_pretty_but_chris_laviano_leads_rutger.html", "content": "For the fifth straight game, Chris Laviano didn&#39;t throw a touchdown pass Saturday afternoon at Army. But for the first time in that same five-game stretch, <b>Rutgers</b>&#39; third-year sophomore quarterback led his team to victory. &quot;We just won the game <b>...</b>", "title": "Stats weren&#39;t pretty, but Chris Laviano leads <b>Rutgers</b> to satisfying win"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Frookie-linemen-rise-to-occasion-for-rutgers", "content": "Whether he played the role of riverboat gambler in his drastic shuffling of the deck or he just played the hand he was dealt, head coach Kyle Flood pushed all the right buttons for the <b>Rutgers</b> football team last Saturday in the 31-21 win over Army at <b>...</b>", "title": "Rookie linemen rise to occasion for <b>Rutgers</b>"}, {"url": "http%3A%2F%2Fwww.theyeshivaworld.com%2Fnews%2Fheadlines-breaking-stories%2F363425%2Frutgers-university-lowering-flags-to-half-staff-in-memory-of-ezra-schwartz-hyd-.html", "content": "ezra-schwartz An email was sent to all <b>Rutgers</b> University staff and students today telling them that <b>Rutgers</b> is lowering their flags to half staff in memory of 2 victims of terror who were connected with <b>Rutgers</b>. One of them is Ezra Schwartz HY”D, who <b>...</b>", "title": "<b>Rutgers</b> University Lowering Flags To Half Staff In Memory of Ezra Schwartz HY&#39;D"}, {"url": "http%3A%2F%2Fnews.rutgers.edu%2Fresearch-news%2Ftwo-rutgers-professors-named-fellows-top-national-science-association%2F20151116", "content": "NEW BRUNSWICK, N.J. – Two <b>Rutgers</b> professors are among 347 members of the American Association for the Advancement of Science (AAAS) who have been elevated to the rank of fellow. The pre-eminent national organization selects its fellows based on&nbsp;...", "title": "Two <b>Rutgers</b> Professors Named Fellows of Top National Science Association"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Fsophomore-diver-breaks-school-record-for-rutgers", "content": "Sophomore Addison Walkowiak set a new mark during the 1-meter dive event on Saturday for the <b>Rutgers</b> swimming and diving team at the Frank Elm Invitational. The Ballston Spy, New York, native posted a score of 321.80 on the dive, breaking the record of&nbsp;...", "title": "Sophomore diver breaks school record for <b>Rutgers</b>"}, {"url": "http%3A%2F%2Fnewbrunswicktoday.com%2Farticle%2Fformer-cbs-boss-raising-funds-new-rutgers-adult-autism-center", "content": "According to a <b>Rutgers</b> news release, the unique facilities will encourage autistic adults to live and work independently in a university setting. Mel Karmazin, the former CEO of Viacom, CBS, and Sirius XM Radio, is working closely with the <b>Rutgers</b> <b>...</b>", "title": "Former CBS Boss Raising Funds For New <b>Rutgers</b> Adult Autism Center"}, {"url": "http%3A%2F%2Fnews.rutgers.edu%2Fnews%2Frutgers-giving-day-aims-raise-500000-through-1500-gifts-24-hours%2F20151122", "content": "The goal is to raise $500,000 through 1,500 gifts or more, said Danielle Chirico, SAS &#39;12, assistant director of millennial philanthropy at <b>Rutgers</b> University Foundation. The day is part of Giving Tuesday, an international campaign that began four <b>...</b>", "title": "<b>Rutgers</b> Giving Day Aims to Raise $500000 Through 1500 Gifts in 24 hours"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Frutgers-newark-formally-opens-new-residence-hall", "content": "Residents at <b>Rutgers</b> – Newark now have a new home they can look forward to living in. On Tuesday, Nov. 17, the school opened a new residence hall at 15 Washington Street, said Angelita Bonilla, Associate Dean for Student Affairs. The building was&nbsp;...", "title": "<b>Rutgers</b> - Newark formally opens new residence hall"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersbasketball%2Findex.ssf%2F2015%2F11%2Frutgers_vs_st_johns_rapid_reaction.html", "content": "QUEENS, N.Y. — <b>Rutgers</b> entered Thursday night&#39;s matchup against St. John&#39;s with a 2-0 record and plenty to prove. After a pair of wins against lightweights, the Scarlet Knights traveled to Carnesecca Arena to face their former Big East rivals. While <b>...</b>", "title": "<b>Rutgers</b> collapses in 61-59 loss to St. John&#39;s | Rapid Reaction"}, {"url": "http%3A%2F%2Fwww.onthebanks.com%2F2015%2F11%2F24%2F9783142%2Frutgers-olympic-sports-soccer-cross-country-volleyball", "content": "Yeah, <b>Rutgers</b> is a soccer school. The women are in the Elite Eight of the NCAA Tournament for the first time in program history. The details of the women&#39;s dominating performance over the AAC Champion UConn Huskies can be found here.", "title": "<b>Rutgers</b> Olympic Sports: Soccer rules!"}, {"url": "http%3A%2F%2Fwww.nj.com%2Fnews%2Findex.ssf%2F2015%2F11%2Famerican_killed_in_mali_siege_grew_up_in_nj_gradua.html", "content": "After achieving her Bachelors in Psychology in 1995 from <b>Rutgers</b> University, she spent more than two years in Africa with the Peace Corps. She went on to earn her MPH and MPA from Columbia University&#39;s Joseph Mailman School of Public Health and&nbsp;...", "title": "American killed in Mali siege grew up in N.J., graduated from <b>Rutgers</b>"}, {"url": "http%3A%2F%2Fwww.capitalnewyork.com%2Farticle%2Fcity-hall%2F2015%2F11%2F8583733%2Fcity-hall-rutgers-propose-study-trace-illegal-guns", "content": "The Mayor&#39;s Office of Criminal Justice and the New York Police Department have proposed partnering with <b>Rutgers</b> University&#39;s School of Criminal Justice on an 18-month, $500,000 contract to study exactly how illegal guns enter neighborhoods in New York&nbsp;...", "title": "City Hall, <b>Rutgers</b> propose study to trace illegal guns"}, {"url": "http%3A%2F%2Fnews.rutgers.edu%2Fnews%2Frutgers-introduce-more-colorful-hardier-cranberry%2F20151122", "content": "Shawn Cutts, president of American Cranberry Growers Association, which represents 25 family farms in New Jersey, said the work that <b>Rutgers</b> researchers do helps the industry thrive. “Not only do they help us grow higher-yielding cranberry varieties <b>...</b>", "title": "<b>Rutgers</b> to Introduce a More Colorful, Hardier Cranberry"}, {"url": "http%3A%2F%2Fwww.newsindiatimes.com%2Fan-ex-rutgers-student-humanitarian-terror-victim-is-mourned", "content": "The Massachusetts-born Indian-American, who went to <b>Rutgers</b> University, was the only American citizen to have been killed in the attack that took the lives of 27 other people. The 41-year-old international aid worker visited her parents&#39; hometown Pune <b>...</b>", "title": "An Ex-<b>Rutgers</b> Student, Humanitarian, Terror Victim Is Mourned"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_vs_army_live_updates_analysis_and_fan_chat.html", "content": "... • LIVE scoring updates in the box score above. • Analysis and fan talk flow in the comments section below. Join in! • For the latest news and updates, REFRESH this page frequently. • App users: For the best mobile experience, use the mobile web <b>...</b>", "title": "<b>Rutgers</b> vs. Army: LIVE updates, analysis and fan chat"}, {"url": "http%3A%2F%2Fwww.testudotimes.com%2F2015%2F11%2F23%2F9785686%2Fterps-rutgers-football-game-time-tv-score-2015", "content": "If you signed up using a 3rd party account like Facebook or Twitter, please login with it instead. Forgot username? We&#39;ll email it to you. If you signed up using a 3rd party account like Facebook or Twitter, please login with it instead. Forgot password?", "title": "Maryland vs. <b>Rutgers</b> 2015 game updates"}, {"url": "http%3A%2F%2Fphiladelphia.cbslocal.com%2F2015%2F11%2F22%2Frutgers-prez-insists-future-of-camden-campus-is-secure%2F", "content": "CAMDEN, N.J. (CBS) – There are probably a lot of people at <b>Rutgers</b>-Camden breathing a sigh of relief after a visit from the University&#39;s President this week. Robert Barchi was in town to herald the opening of a new home for the English Department, but&nbsp;...", "title": "<b>Rutgers</b> Prez Insists Future Of Camden Campus Is Secure"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Fwhy_is_leading_miami_coaching_candidate_mario_cris.html", "content": "Maybe Mario Cristobal is just really interested in following all of the 140-characters-or-less observations from Anthony Russo, Patrice Rene and several other high school football prospects who have given non-binding commitments to play for <b>Rutgers</b>.", "title": "Why is Miami coaching candidate Mario Cristobal suddenly following <b>Rutgers</b> <b>...</b>"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Frutgers-alumna-among-22-killed-in-mali-attack", "content": "Traveling overseas to spread peace, education and health care were among Anita Ashok Datar&#39;s many passions. Datar, a <b>Rutgers</b> Class of 1995 alumna, was among the group of at least 22 people killed during an attack in West Africa on Friday, in which&nbsp;...", "title": "<b>Rutgers</b> alumna among 22 killed in Mali attack"}, {"url": "http%3A%2F%2Fwww.app.com%2Fstory%2Fsports%2Fcollege%2Frutgers%2F2015%2F11%2F21%2Frutgers-paul-james-looking-overcome-latest-injury%2F76105572%2F", "content": "PISCATAWAY -- An oft-injured redshirt senior running back, <b>Rutgers</b>&#39; Paul James almost made it through an entire season without injury. The Glassboro native had his 2013 season interrupted for four games by a broken fibula and his 2014 season ended four&nbsp;...", "title": "<b>Rutgers</b>&#39; Paul James looking to overcome latest injury"}, {"url": "http%3A%2F%2Fwww.app.com%2Fstory%2Fsports%2Fcollege%2F2015%2F11%2F22%2F5-thoughts-5-quotes-rutgers-win-over-uca%2F76209202%2F", "content": "FIVE THOUGHTS. <b>Rutgers</b>&#39; defense took the evening off. With the exception of Deshawn Freeman (4 blocks, 4 steals), the Scarlet Knights were habitually late on close-outs and rotations, and there was virtually no second-chance D by the guards.", "title": "5 thoughts, 5 quotes from <b>Rutgers</b>&#39; win over UCA"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_running_back_paul_james_wont_apply_for_6th.html", "content": "PISCATAWAY — Paul James put to rest a thought some <b>Rutgers</b> fans have had since his season-ending knee injury last season. James told NJ Advance Media that he won&#39;t pursue a sixth-year of eligibility. It was unclear if a sixth-year would even be an&nbsp;...", "title": "<b>Rutgers</b> running back Paul James won&#39;t apply for 6th year of eligibility"}, {"url": "http%3A%2F%2Fwww.mycentraljersey.com%2Fstory%2Fsports%2Fcollege%2Fscarlet-scuttlebutt%2F2015%2F11%2F22%2Fmarcus-applefield-zack-heeman-breathe-new-life-into-rutgers-offensive-line%2F76241630%2F", "content": "With redshirt freshmen Zack Heeman and Marcus Applefield making their first career starts and veteran guard Chris Muller sliding over to make his first career start at center, <b>Rutgers</b> kept it simple Saturday and rushed 39 times for 254 yards in a 31-21 <b>...</b>", "title": "Marcus Applefield, Zack Heeman breathe new life into <b>Rutgers</b> offensive line"}, {"url": "http%3A%2F%2Fwww.nj.com%2Fmiddlesex%2Findex.ssf%2F2015%2F11%2Frutgers_football_players_probationary_program.html", "content": "NEW BRUNSWICK — The lawyers for three ex-<b>Rutgers</b> University football players signaled in court Wednesday that their clients would likely apply for pre-trial intervention in an alleged assault near the New Brunswick campus. The probationary program&nbsp;...", "title": "Ex-<b>Rutgers</b> football players to apply for probationary program, could avoid jail"}, {"url": "http%3A%2F%2Fnewbrunswicktoday.com%2Farticle%2Fthree-unsolved-armed-robberies-reported-near-rutgers-five-days", "content": "The incidents come just two weeks after Halloween weekend, when three young men, including two students, were injured in a gruesome knifefight inside a <b>Rutgers</b> dormitory, and another student reported being robbed on-campus and threatened with a&nbsp;...", "title": "Three Unsolved Armed Robberies Reported Near <b>Rutgers</b> in Five Days"}, {"url": "https%3A%2F%2Fswimswam.com%2F138626-2%2F", "content": "While Navy continued to blow through team scoring, <b>Rutgers</b>&#39; Joanna Wu again put on an impressive individual display with two more event wins to go with the three she earned on Friday. That began with a 25.59 leadoff on the 200 medley relay as the <b>...</b>", "title": "Wu, Nihipali, Kwok Break Meet Records, But Navy Rolls On at <b>Rutgers</b>"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersbasketball%2Findex.ssf%2F2015%2F11%2Frutgers_vs_howard_rapid_reaction.html", "content": "PISCATAWAY — Highly touted freshman guard Corey Sanders came off the bench to score 15 points in his <b>Rutgers</b> debut, helping the Scarlet Knights defeat Howard, 82-70, on Sunday afternoon at the <b>Rutgers</b> Athletic Center. Sanders shot 4-of-7 from the&nbsp;...", "title": "<b>Rutgers</b> defeats Howard, 82-70, in Corey Sanders&#39; debut | Rapid reaction"}, {"url": "http%3A%2F%2Fwww.maryvilledailyforum.com%2Fnews%2Fstate_news%2Farticle_76b44f72-5015-5840-b280-5f1844d0383a.html", "content": "Thank you for reading 8 free articles on our site. You can come back at the end of your 30-day period for another 8 free articles, or you can purchase a subscription at this time and continue to enjoy valuable local news and information. If you need <b>...</b>", "title": "AP-BKC--Creighton-<b>Rutgers</b> Box"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Fgreg_schiano_reader_wants_to_know_why_bring_him_ba.html", "content": "You want a reaction at your next <b>Rutgers</b> tailgate? Say the words &quot;maybe we should bring back Greg Schiano as head coach&quot; and be prepared to either duck from the anger or open your arms for the warm embrace. I put his name in a column assessing where&nbsp;...", "title": "Greg Schiano? Reader wants to know: Why bring him back to <b>Rutgers</b>? | Politi&#39;s <b>...</b>"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgerswomen%2Findex.ssf%2F2015%2F11%2Frutgers_womens_soccer_team_tops_hofstra_advances_i.html", "content": "For the third time in program history, the <b>Rutgers</b> women&#39;s soccer team is headed to the Sweet 16. Behind a pair of first-half goals and the 17th shutout of the season by goalkeeper Casey Murphy, the Scarlet Knights topped Hofstra, 2-0, on Friday night <b>...</b>", "title": "<b>Rutgers</b> women&#39;s soccer team tops Hofstra, advances in NCAA Tournament"}, {"url": "http%3A%2F%2Fwww.app.com%2Fstory%2Fsports%2Fcollege%2Frutgers%2F2015%2F11%2F20%2Frutgers-early-enrollees-head-tested-freshmen-class%2F76107662%2F", "content": "“Sometimes I almost feel like I&#39;m part of both classes, ahead of and behind me,” said Bateky, a <b>Rutgers</b> defensive lineman. “I&#39;ve learned from the class ahead of me and I can teach the freshmen some stuff they need because I&#39;ve had a little more <b>...</b>", "title": "<b>Rutgers</b> early enrollees at head of tested freshmen class"}, {"url": "http%3A%2F%2Fwww.foxsports.com%2Fcollege-football%2Fstory%2Frutgers-scarlet-knights-leonte-carroo-senior-day-112415", "content": "<b>Rutgers</b> football is preparing for its last game of the regular season Saturday with 11 players looking at their last game in Piscataway. The group includes only two fourth-year seniors -- star receiver Leonte Carroo and kicker Kyle Federico --as well <b>...</b>", "title": "Small <b>Rutgers</b> senior class getting ready for last hurrah as Scarlet Knights"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_nebraska_football_rapid_reaction.html", "content": "PISCATAWAY — When the schedule was unveiled, <b>Rutgers</b>&#39; season figured to be defined by a four-game stretch against Big Ten powers Ohio State, Wisconsin, Michigan and Nebraska. As it turned out, the four-game stretch all but ended the Scarlet Knights&#39;&nbsp;...", "title": "<b>Rutgers</b> routed by Nebraska, 31-14, guaranteeing losing season | Rapid reaction"}, {"url": "http%3A%2F%2Fwww.app.com%2Fstory%2Fsports%2Fcollege%2Frutgers%2F2015%2F11%2F17%2Fwhat-does-rutgers-football-have-left-play-lost-season%2F75912108%2F", "content": "PISCATAWAY – The seniors have graduation – and, in a couple cases, NFL careers – ahead. The non-seniors can look forward to a fresh start next season. The coaching staff could be preoccupied with concerns about job security. So what&#39;s to stop <b>Rutgers</b>&nbsp;...", "title": "What does <b>Rutgers</b> football have left to play for in lost season?"}, {"url": "http%3A%2F%2Fnews.rutgers.edu%2Fnews%2Frutgers%25E2%2580%2593camden-professor%25E2%2580%2599s-art-installation-display-philadelphia-international-airport%2F20151124", "content": "“I began my career as a painter and a printmaker and, in graduate school, migrated into creating room-size environments,” says Amdur, an associate professor of art at <b>Rutgers</b> University–Camden. The truth is that I have always understood myself to be a&nbsp;...", "title": "<b>Rutgers</b>–Camden Professor&#39;s Art Installation on Display at Philadelphia <b>...</b>"}, {"url": "http%3A%2F%2Fwww.lansingstatejournal.com%2Fstory%2Fsports%2Fcollege%2Fmsu%2F2015%2F11%2F21%2Fspartan-volleyball-scores-sweep-rutgers%2F76207252%2F", "content": "MSU won its second straight match, a 3-0 decision over homestanding <b>Rutgers</b> (25-15, 25-21, 25-13) on Saturday in New Brunswick, NJ. Rachel Minarick and Allyssah Fitterer each posted double-doubles, while Alyssa Garvelink led the MSU attack with 12&nbsp;...", "title": "Spartan volleyball scores sweep at <b>Rutgers</b>"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_mens_soccer_liu-brooklyn_ncaa_tournament.html", "content": "The <b>Rutgers</b> men&#39;s soccer team needed 110 minutes and a shootout session, but thanks to a diving save by David Greczek on the final shot of a rain-soaked evening, the Scarlet Knights are moving on in the NCAA Tournament. Tied at 1-1 after regulation and&nbsp;...", "title": "<b>Rutgers</b> men&#39;s soccer team wins in shootout, tops LIU-Brooklyn in NCAA Tournament"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2Frutgers_football_commitment_performance_recap_week_7.html", "content": "Stick with NJ.com for our <b>Rutgers</b> football commit of the week – from the list of prospects above. (Some of the statistics attained for this report were retrieved from maxpreps.com.) Todderick Hunt may be reached at thunt@njadvancemedia.com. Follow him <b>...</b>", "title": "<b>Rutgers</b> football commitment performance recap, weekend of 11/13"}, {"url": "https%3A%2F%2Fnews.camden.rutgers.edu%2F2015%2F11%2Fspace-jam-team-chemistry-counts-beyond-the-stars%2F", "content": "The <b>Rutgers</b>–Camden scholar, whose previous research in this area studied the long-term implications for the mental health of employees working in isolation — think Matt Damon in The Martian — says space station crews are put together based on who is&nbsp;...", "title": "Space Jam: Team Chemistry Counts Beyond the Stars"}, {"url": "http%3A%2F%2Fwww.nj.com%2Frutgersfootball%2Findex.ssf%2F2015%2F11%2F5_rutgers_players_who_should_get_extended_playing.html", "content": "PISCATAWAY — <b>Rutgers</b> coach Kyle Flood&#39;s top priority is to win the final two games of the regular season. As a result, Flood said he doesn&#39;t intend to make any changes to the lineup to get younger players more playing time. &quot;In terms of going out of <b>...</b>", "title": "5 <b>Rutgers</b> players who should get extended playing time in final 2 games"}, {"url": "http%3A%2F%2Fwww.app.com%2Fstory%2Fsports%2Fcollege%2Frutgers%2F2015%2F11%2F17%2Fsen-codey-involved-rutgers-seton-hall-basketball-rivalry-in-making%2F75925504%2F", "content": "When the NCAA Tournament first-round matchup between <b>Rutgers</b> and Seton Hall was orchestrated last season, state Sen. Richard Codey, D-Essex, sent letters to both athletic directors urging an annual nonconference game to promote — much like the&nbsp;...", "title": "With Sen. Codey involved, <b>Rutgers</b>-Seton Hall rivalry in the making"}, {"url": "http%3A%2F%2Fhighschoolsports.nj.com%2Fnews%2Farticle%2F-2017487464416095081%2Fmeet-the-2015-16-rutgers-wrestling-team%2F", "content": "With 141-pounder Anthony Ashnault, heavyweight Billy Smith and 165-pounder Anthony Perrotti leading the way, the <b>Rutgers</b> wrestling team returns a strong core for the 2015-16 season and is looking to make an impact in the cutthroat Big Ten Conference.", "title": "Meet the 2015-16 <b>Rutgers</b> wrestling team"}, {"url": "http%3A%2F%2Fwww.mycentraljersey.com%2Fstory%2Fmoney%2F2015%2F11%2F21%2Frutgers-research-grants-and-contracts-increase%2F75890170%2F", "content": "While most federal agencies were unable to increase their level of research support, <b>Rutgers</b> University has received a significant increase in federal funding. Pictured is Kathy Roberts, a research technician with <b>Rutgers</b> Translational Sciences, a part <b>...</b>", "title": "<b>Rutgers</b>&#39; research grants and contracts increase"}, {"url": "http%3A%2F%2Fwww.dailytargum.com%2Farticle%2F2015%2F11%2Fmichigan-state-slays-rutgers-on-senior-night", "content": "Senior outside hitter Alex Lassa laces a serve Saturday at the College Avenue Gymnasium. Michigan State&#39;s own outside hitter, Holly Toliver, returned the first of the match with a spike to set the tone as the Spartans walked over the Knights on Senior <b>...</b>", "title": "Michigan State overpowers <b>Rutgers</b> on Senior Night at College Avenue Gymnasium"}, {"url": "http%3A%2F%2Fwww.diamondbackonline.com%2Fsports%2Fnotebook-maryland-qb-situation-uncertain-going-into-rutgers-game%2Farticle_3bbf7fac-9188-11e5-a1f0-c3ad01e63417.html", "content": "Terrapins football interim coach Mike Locksley isn&#39;t sure who&#39;s going to start at quarterback in the Terps&#39; season finale against <b>Rutgers</b>. Perry Hills, who&#39;s started seven of the Terps&#39; 11 games, missed the Indiana game with mononucleosis and is <b>...</b>", "title": "NOTEBOOK: Maryland QB situation uncertain going into <b>Rutgers</b> game"}, {"url": "http%3A%2F%2Fbuchtelite.com%2F29834%2Fshowcase%2Fno-3-akron-cruises-over-rutgers-in-ncaa-tourney%2F", "content": "The University of Akron soccer team began their march to another possible championship by thumping the <b>Rutgers</b> Scarlet Knights, 6-1, in second-round action of the NCAA Tournament Sunday at FirstEnergy Stadium – Cub Cadet Field. Richie Laryea and&nbsp;...", "title": "No. 3 Akron cruises over <b>Rutgers</b> in NCAA Tourney"}, {"url": "http%3A%2F%2Findiancountrytodaymedianetwork.com%2F2015%2F11%2F18%2Fdark-ugly-past-rutgers-being-explored-162443", "content": "A newly formed committee at <b>Rutgers</b> University is charged with exploring “enslaved and disenfranchised populations” in the university&#39;s 249-year history. <b>Rutgers</b>, the three-campus state university of New Jersey, is one of nine colonial colleges that <b>...</b>", "title": "Dark, Ugly Past of <b>Rutgers</b> Being Explored"}]